cf_billing/InformationRegisters/бестТУНаСтруктуреСети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТУНаСтруктуреСети</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестТУНаСтруктуреСети/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СтруктураСетиТочкиУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
	Иначе
		ЕстьДействующиеТочки 			= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочки" Тогда
				ЕстьДействующиеТочки 	= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда
			РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтруктураСетиТочкиУчета());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, КлючПомещения, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСтруктураСетиТочкиУчета()
	
	Текст =
	"ВЫБРАТЬ
	|	бестТУНаСтруктуреСетиСрезПоследних.Организация КАК Организация,
	|	бестТУНаСтруктуреСетиСрезПоследних.Район КАК Район,
	|	бестТУНаСтруктуреСетиСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	бестТУНаСтруктуреСетиСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестТУНаСтруктуреСетиСрезПоследних.СтруктураСети КАК СтруктураСети
	|ИЗ
	|	РегистрСведений.бестТУНаСтруктуреСети.СрезПоследних(
	|			&Период,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочки.Организация,
	|					ДействующиеТочки.Район,
	|					ДействующиеТочки.КлючПомещения,
	|					ДействующиеТочки.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочки КАК ДействующиеТочки)) КАК бестТУНаСтруктуреСетиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
